Revit 2024 API
IRevisionsOnSheetUIServer Interface
 The interface used to provide UI for sheet's Revisions On Sheet property.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public interface IRevisionsOnSheetUIServer : IExternalServer
Visual Basic
Public Interface IRevisionsOnSheetUIServer _
	Inherits IExternalServer
Visual C++
public interface class IRevisionsOnSheetUIServer : IExternalServer
See Also
IRevisionsOnSheetUIServer Members
Autodesk.Revit.UI Namespace